import type { PeriodType } from '../types/Period.types.tsx';

export const Periods: PeriodType[] = [{
    id: '1',
    name: 'Технологии',
    start: 1980,
    end: 1986,
    events: [{
        id: '1',
        title: '1980',
        text: 'Sinclair Research выпускает домашний компьютер ZX80.'
    }, {
        id: '2',
        title: '1982',
        text: 'Появился домашний компьютер ZX Spectrum выпущенный компанией Sinclair Research.'
    }, {
        id: '3',
        title: '1983',
        text: 'Sinclair Research выпускает домашний компьютер ZX80.'
    }, {
        id: '4',
        title: '1984',
        text: 'Появился домашний компьютер ZX Spectrum выпущенный компанией Sinclair Research.'
    }, {
        id: '5',
        title: '1985',
        text: 'Sinclair Research выпускает домашний компьютер ZX80.'
    }]
}, {
    id: '2',
    name: 'Кино',
    start: 1987,
    end: 1991,
    events: [{
        id: '1',
        title: '1987',
        text: '«Хищник»/Predator, США (реж. Джон Мактирнан).'
    }, {
        id: '2',
        title: '1988',
        text: '«Кто подставил клолика Роджера»/Who Frame Roger Rabbit, США (реж. Роберт Земекис).'
    }, {
        id: '3',
        title: '1989',
        text: '«Назад в будущее 2»/Back To The Future 2, США (реж. Роберт Земескис).'
    }, {
        id: '4',
        title: '1990',
        text: '«Крепкий орешек 2»/Die Hard 2, США (реж. Ренни Харлин).'
    }, {
        id: '5',
        title: '1991',
        text: '«Семейка Аддамс»/The Addams Family, США, (реж. Барри Зонненфельд).'
    }]
}, {
    id: '3',
    name: 'Литература',
    start: 1992,
    end: 1997,
    events: [{
        id: '1',
        title: '1992',
        text: 'Нобелевская премия по литературе - Дерек Уолкотт, «За блестящий образец карибского эпоса в 64 разделах».'
    }, {
        id: '2',
        title: '1994',
        text: '«Бессонница» - роман Стивена Кинга.'
    }, {
        id: '3',
        title: '1995',
        text: 'Нобелевская премия по литературе - Шеймас Хини.'
    }, {
        id: '4',
        title: '1997',
        text: '«Бессонница» - роман Стивена Кинга.'
    }]
}, {
    id: '4',
    name: 'Театр',
    start: 1999,
    end: 2004,
    events: [{
        id: '1',
        title: '1999',
        text: 'Премьера балета «Золушка» в постановке Жан-Кристофа Майо, сценография Эрнеста Письона.'
    }, {
        id: '2',
        title: '2000',
        text: 'Возобновление издания журнала «Театр».'
    }, {
        id: '3',
        title: '2002',
        text: 'Премьера прилогии Тома Стоппарда «Берег Утопии», Королевский Национальный театр, Лондон.'
    }, {
        id: '4',
        title: '2003',
        text: 'Возобновление издания журнала «Театр».'
    }, {
        id: '5',
        title: '2004',
        text: 'Премьера прилогии Тома Стоппарда «Берег Утопии», Королевский Национальный театр, Лондон.'
    }]
}, {
    id: '5',
    name: 'Спорт',
    start: 2006,
    end: 2014,
    events: [{
        id: '1',
        title: '2006',
        text: 'Баскетбольный клуб ЦСКА стал победителем национального первенства России.'
    }, {
        id: '2',
        title: '2008',
        text: 'С 8 по 24 августа в Пекине прошли 29-е летние Олимпийские игры.'
    }, {
        id: '3',
        title: '2010',
        text: '13-28 февраля в Ванкувере: Зимние Олимпийские игры 2010 года.'
    }, {
        id: '4',
        title: '2012',
        text: '2 августа - Летние Олимпийские игры.'
    }, {
        id: '5',
        title: '2014',
        text: 'XXII зимние Олимпийские игры (Сочи, Россия).'
    }]
}, {
    id: '6',
    name: 'Наука',
    start: 2015,
    end: 2022,
    events: [{
        id: '1',
        title: '2015',
        text: '13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды.'
    }, {
        id: '2',
        title: '2016',
        text: 'Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11.'
    }, {
        id: '3',
        title: '2017',
        text: 'Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi.'
    }, {
        id: '4',
        title: '2018',
        text: 'Старт космического аппарата Solar Probe Plus, предназначенного для изучения Солнца.'
    }, {
        id: '5',
        title: '2019',
        text: 'Google объявил о создании 53-кубитного квантового компьютера.'
    }, {
        id: '6',
        title: '2020',
        text: 'Корабль Crew Dragon вернулся на Землю из первого пилотируемого полёта.'
    }]
}];
